app/controllers/api/boards_controller.rb

INSERT INTO "boards" ("author_id", "title", "created_at", "updated_at", "private") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 2], ["title", "Physics"], ["created_at", "2020-11-20 16:58:58.559480"], ["updated_at", "2020-11-20 16:58:58.559480"], ["private", true]]
SELECT  "boards".* FROM "boards" WHERE "boards"."author_id" = $1 AND "boards"."id" = $2 LIMIT $3  [["author_id", 7], ["id", 1], ["LIMIT", 1]]
---
    def create
        @board = Board.new(board_params)
        @board.author_id = current_user.id
        has_pin = params[:board][:pinId] != -1

        if @board.save
            if has_pin
                BoardPin.create({board_id: @board.id, pin_id: params[:board][:pinId]})
            end
            @boards = current_user.boards.includes(:pins)

SELECT "boards".* FROM "boards"
---
    def index
        @boards = current_user.boards.includes(:pins)

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
---
    def show
       @board = Board.find_by(id: params[:id])

UPDATE "boards" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "boards"."id" = $4  [["title", "Jupiter"], ["description", "This is about Jupiter"], ["updated_at", "2020-11-23 01:09:16.111607"], ["id", 63]]
---
    def update
        board = current_user.boards.find_by(id: params[:id])

        if board # && @board.valid_date_period
            board.update(board_params)

DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 1]]
---
    def destroy
        @board = current_user.boards.find_by(id: params[:id])
        if @board
            @board.destroy