app/controllers/api/pins_controller.rb

INSERT INTO "pins" ("author_id", "title", "description", "link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author_id", 1], ["title", ""], ["description", ""], ["link", ""], ["created_at", "2020-11-24 03:03:23.646206"], ["updated_at", "2020-11-24 03:03:23.646206"]]
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def create
        @pin = Pin.new(pin_params)
        @pin.author_id = current_user.id

        if @pin.save
            BoardPin.create({board_id: params[:pin][:boardId], pin_id: @pin.id})
            @board = current_user.boards.find(params[:pin][:boardId])
            @user = User.find(@pin.author_id)

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @pin = Pin.find_by(id: params[:id])

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pins" SET "description" = $1, "updated_at" = $2 WHERE "pins"."id" = $3  [["description", "LOLLLLLLLLL"], ["updated_at", "2020-11-23 19:26:01.864637"], ["id", 1]]
---
     def update
        @pin = Pin.find_by(id: params[:id])
        if @pin
            @pin.update(pin_params)

DELETE FROM "pins" WHERE "pins"."id" = $1  [["id", 1]]
---
    def destroy
        @pin = current_user.pins.find_by(id: params[:id])
        @pins = current_user.pins
        if @pin
            @pin.destroy