app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "username", "first_name", "last_name", "password_digest", "session_token", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save