app/views/api/boards/_board.json.jbuilder


json.currentBoards current_user.boards.each do |board|
---
SELECT "boards".* FROM "boards"