app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "MLFq0M9FrVIYYac8O5Hcrg"], ["updated_at", "2020-11-20 17:55:19.467531"], ["id", 7]]
---
  def reset_session_token!
    self.session_token = self.class.generate_session_token
    self.save!